export default function BooksList() {
    const dir_path = "books/";
    const books = [
        { id: 1, title: "Кодекс Цивільного захисту України", src: "kodescz.pdf" },
        { id: 2, title: "Наказ МВС України №116 від 10.02.2022 'Про затвердження Порядку організації внутрішньої, гарнізонної та караульної служб в органах та підрозділах цивільного захисту'", src: "116.pdf" },
        { id: 3, title: 'Наказ ДСНС України №1661 від 31.12.2025 "Про затвердження Правил безпеки праці в органах та підрозділах ДСНС "', src: "1661.pdf" },
        { id: 4, title: 'Наказ МВС України №340 від 26.04.2018 "Про затвердження Статуту дій у надзвичайних ситуаціях органів управління та підрозділів Оперативно-рятувальної служби цивільного захисту та Статуту дій органів управління та підрозділів Оперативно-рятувальної служби цивільного захисту під час гасіння пожеж' , src: "340.pdf" },
        { id: 5, title: 'Наказ МВС України №780 від 25.09.2023 "Про затвердження Порядку організації роботи органів управління та підрозділів, закладів освіти системи ДСНС під час підготовки особового складу, гасіння пожеж, ліквідації наслідків надзвичайних ситуацій та інших небезпечних подій в умовах екстремальних температур, задимленості, загазованості, радіоактивного, хімічного забруднення та біологічного зараження', src: "696.pdf" },
        { id: 6, title: 'Наказ ДСНС України №760 від 26.12.2022р. "Про затвердження Методичних рекомендацій з експлуатації та ремонту пожежних рукавів в пожежно-рятувальних підрозділах Державної служби України з надзвичайних ситуацій";', src: "760.pdf" },
        { id: 7, title: 'Наказ ДСНС України №1212 від 30.09.2025 "Про затвердження Методичних рекомендацій із складання, корегування та відпрацювання оперативних карток гасіння пожеж "', src: "1212.pdf" },
    ];
    return (
        <div className="books-list">
            {books.map((book) => (
                <div key={book.id} className="book-item">
                    <a href={`${dir_path}${book.src}`} target="_blank" rel="noopener noreferrer">
                    <p>{book.title}</p></a>
                </div>
            ))}  
        </div>
    );
}   