'use client'

import { useRouter } from "next/navigation";
import Navbar from "../components/NavBar"
import { BookA } from "lucide-react";
export default function Documents() {
    const router = useRouter();
    const books = [
        { id: 0, name: "Довідник КГП", title: "", src: "kgp" },
        { id: 1, name: "Кодекс Цивільного захисту України", title: "", src: "kodekscz" },
        { id: 2, name: "Наказ МВС України №116 від 10.02.2022", title: "Про затвердження Порядку організації внутрішньої, гарнізонної та караульної служб в органах та підрозділах цивільного захисту", src: "116" },
        { id: 3, name: "Наказ ДСНС України №1661 від 31.12.2025", title: "Про затвердження Правил безпеки праці в органах та підрозділах ДСНС", src: "1661" },
        { id: 4, name: "Наказ МВС України №340 від 26.04.2018", title: "Про затвердження Статуту дій у надзвичайних ситуаціях органів управління та підрозділів Оперативно-рятувальної служби цивільного захисту та Статуту дій органів управління та підрозділів Оперативно-рятувальної служби цивільного захисту під час гасіння пожеж", src: "340" },
        { id: 5, name: "Наказ МВС України №780 від 25.09.2023", title: "Про затвердження Порядку організації роботи органів управління та підрозділів, закладів освіти системи ДСНС під час підготовки особового складу, гасіння пожеж, ліквідації наслідків надзвичайних ситуацій та інших небезпечних подій в умовах екстремальних температур, задимленості, загазованості, радіоактивного, хімічного забруднення та біологічного зараження", src: "696" },
        { id: 6, name: "Наказ ДСНС України №760 від 26.12.2022р.", title: "Про затвердження Методичних рекомендацій з експлуатації та ремонту пожежних рукавів в пожежно-рятувальних підрозділах Державної служби України з надзвичайних ситуацій", src: "760" },
        { id: 7, name: "Наказ ДСНС України №1212 від 30.09.2025 ", title: "Про затвердження Методичних рекомендацій із складання, корегування та відпрацювання оперативних карток гасіння пожеж ", src: "1212" },
    ];
  return (
    <main className="p-4 pb-20">
      <h1 className="text-lg mb-4">Нормативні документи</h1>
      <div className="flex flex-col gap-3">
      {books.map((book) => (
                <div key={book.id} className="bg-[#1A222D] p-4 rounded-xl" onClick={() => router.push(`open?path=${encodeURIComponent(book.src)}`)}>
                    <BookA className="text-red-500" />
                    <h2 className="font-semibold">{book.name}</h2>
                    <p>{book.title}</p>
                </div>
            ))}  
      </div>

      <Navbar />
    </main>
  )
}